using System;
using System.Collections.Generic;

namespace sitisi
{
    class Program
    {
        public static String getFoodInfo(int code)
        {
            DateTime curD = new DateTime();
            // This is how to declare a Dictionary (Java's HashMap equivalent)
            Dictionary<int, String> foodList = new Dictionary<int, string>();

            /*Adding elements to HashMap   [A]->BDOMADA [B]-> DAYFO WEEK [G]-> MORNIGN[0]/NIGHT[1] */
            //1 BRAD
            foodList.Add(111, "1ο.Κρεμμυδόσουπα - Κρέπες ( γέμιση με ζαμπόν και μανιτάρια)"
                    + "2ο.Σπαγγέτι με σάλτσα ντομάτας, τυρί τριμμένο, τυρί φέτα - Πατάτες γιαχνί, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(121, "1ο.Σούπα κρέμα σπανάκι - Σουφλέ λαζάνια"
                    + "2ο.Ψάρι φούρνου με πατατοσαλάτα - Κιμαδόπιτα, πατατοσαλάτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(131, "1ο.Ψαρόσουπα - Σουφλέ πατάτας"
                    + "2ο.Ογκρατέν (Μακαρόνια), τυρί φέτα - Μελιτζάνες ιμάμι, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(141, "1ο.Σούπα με μακαρονάκι και φασόλια - Τορτίγιες με πατάτες και φρέσκο κρεμμύδι"
                    + "2ο.Σουτζουκάκια με γαρνιτούρα ζυμαρικά με σάλτσα ντομάτας - Χυλοπίτες Πηλιορίτικες, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(151, "1ο.Σούπα μπεαρναίζ - Κρέπες (γέμιση ροκφόρ)"
                    + "2ο.Ομελέτα με πατάτες, τυρί φέτα - Τυρόπιτα, κοφτό μακαρονάκι"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(161, "1ο.Σούπα Σαβουαγιάρντ - Μελιτζανόπιτα"
                    + "2ο.Θράψαλα τηγανιτά με πιλάφι - Μπιφτέκι σχάρας με πιλάφι"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(171, "1ο.Σούπα μπιστού - Παραδοσιακή μλήνα Σερρών"
                    + "2ο.Γαλοπούλα στήθος φέτα, πιλάφι, πιλάφι, τυρί φέτα - Πίτσα σπέσιαλ"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            // 1 MES
            foodList.Add(110, "1ο.Κρεατόσουπα με διάφορα λαχανικά - Τορτίγιες με λαχανικά"
                    + "2ο.Μουσακάς - Καλαμαράκια γιαχνί με πιλάφι"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(120, "1ο.Σούπα Ριζότο μανιτάρια - Μακεδονίτικη κολοκυθόπιτα"
                    + "2ο.Κοτόπουλο κοκκινιστό με αρακά, τυρί φέτα - Χοιρινό κοντοσούβλι του ΣΕΦ, πατάτες φούρνου"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(130, "1ο.Μινεστρόνι αλά Μιλανέζε - Ντολμαδάκια γιαλατζί"
                    + "2ο.Φασόλια γίγαντες φούρνου, τυρί φέτα, ελιές - Αγκινάρες αλά πολίτα, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(140, "1ο.Κρεατόσουπα με κριθαράκι - Πίτα Καισαρείας"
                    + "2ο.Μπριζόλα Χοιρινή με πουρέ πατάτας - Κοτόπουλο εντσιλάντας με κοχυλάκια , τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(150, "1ο.Ντολμαδάκια βελουτέ - Φρουτάλια με πατάτα κια λουκάνικα"
                    + "2ο.Φακές σούπα, ελιές, τυρί φέτα - Σουφλέ λαζάνια με κιμά, τυρί τριμμένο, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(160, "1ο.Κρεατόσουπα - Καλαμαράκια κρασάτα"
                    + "2ο.Μοσχάρι Ορλώφ, με ζυμαρικά - Κοτόπουλο λεμονάτο στο φούρνο με πατάτες, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(170, "1ο.Χορτόσουπα - Κρέπες (γέμιση τυρί)"
                    + "2ο.Χοιρινό γιουβέτσι - Μοσχάρι σούπα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");

            // 2 BRAD 
            foodList.Add(211, "1ο.Σούπα λουγκσάν - Ομελέτα στραπατσάδα"
                    + "2ο.Σπανακόρυζο, τυρί φέτα - Μακαρονάκι τυμπάλ, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(221, "1ο.Κοτόπουλο αυγολέμονο - Κρέπες ( γέμιση ζαμπόν κρεμμύδια)"
                    + "2ο.Κεφτέδες με πουρέ πατάτας - Ψαρόσουπα και πατατοσαλάτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(231, "1ο.Σούπα με κοκκινιστό τραχανά - Στριφτή τυρόπιτα Κοζανίτικη"
                    + "2ο.Αρακάς, τυρί φέτα - Σπαγγέτι με κιμά, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(241, "1ο.Σούπα βελουτέ πατάτας - Μακεδονίτικη κολοκυθόπιτα"
                    + "2ο.Σουτζουκάκια σμυρνέικα με ζυμαρικά - Ριζότο με θαλασσινά, τυρί γκούντα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(251, "1ο.Αρακόσουπα με πράσο - Σπανακοτυρόπιτα Καστοριάς"
                    + "2ο.Σπανακοτυρόπιτα, πατάτες νιοφίν - Ομελέτα αλά Αμερικέν, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(261, "1ο.Καροτόσουπα βελουτέ με πράσα - Ψάρι εποχής (ψιλό) τηγανητό"
                    + "2ο.Πρεβεζιάνικος μπακαλιάρος φιλέτο με πράσα, σουφλέ λαχανικών - Μπιτόγκ αλά Ρους, πουρές πατάτας"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(271, "1ο.Σούπα γαλοπούλας με λαχανικά - Κρέπες (γέμιση με ζαμπόν και τυρί)"
                    + "2ο.Γαλοπούλα σπέσιαλ, ρολό, πατάτες αλά χασάπα, τυρί φέτα - Τυρόπιτα στριμμένη με μυζήθρα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            // 2 MES
            foodList.Add(210, "1ο.Σούπα κρέσυ - Κοζανίτικο κτχι με φέτα και πράσο"
                    + "2ο.Φιλέτα γαλέου, πουρές πατάτας - Παστίτσιο"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(220, "1ο.Σούπα κάρδαμο - Τονοσαλάτα"
                    + "2ο. Κοτόπουλο ψητό ,ε ζυμαρικά, τυρί φέτα - Χοιρινό λεμονάτο στο φούρνο με πατάτες"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(230, "1ο.Σούπα αλενουά - Λαχανοντολμάδες αυγολέμονο"
                    + "2ο.Φασόλια φούρνου, τυρί φέτα - Μπάμιες, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(240, "1ο.Σούπα κρέμα αγκινάρας - Ντολμαδάκια αυγολέμονο"
                    + "2ο.Κοτόπουλο Σαιν Ζερμέν με πιλάφι, τυρί φέτα - Χοιρινό κρασάτο με ρύζι"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(250, "1ο.Σούπα κρέμας μπρόκολο - Σουπιές σπανάκι"
                    + "2ο.Ρεβίθια φούρνου, τυρί φέτα - Σπαγγέτι καρμπονάρα, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(260, "1ο.Σούπα σαμπενουά - Εντσιλάδας με λουκάνικο"
                    + "2ο.Μοσχάρι Κελαηδί λάρισας, σουφλέ ζυμαρικών - Κοτόπουλο Μιλανέζε, σουφλέ λαχανικών, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            foodList.Add(270, "1ο.Σούπα ντυπαρύ - Burittos με ομελέτα ( ελληνικός τρόπος)"
                    + "2ο.Αρνί γιουβέτσι - Μοσχάρι φαντασία με ραβιόλια"
                    + "3ο.Σαλάτα εποχής ωμή - Σαλάτα εποχής βραστή"
                    + "4ο.Γλυκό - Φρούτο εποχής");
            // 3 BRAD
            foodList.Add(311, "1ο.Σούπα με κρέμα σπανάκι - Ντολμαδάκια γιαλατζί"
                    + "2ο.Γεμιστά, τυρί φέτα - Χυλοπίτες Πυλιορίτκες"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(321, "1ο.Σούπα μακαρονάκι και φασόλια - Τυροπιτάκια"
                    + "2ο.Κεφτεδάκια παραδοσικά φούρνου και πατάτες φούρνου - Ψάρι φουύρνου με πατατοσαλάτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(331, "1ο.Σούπα Σαβουαγιάρντ - Κρέπες με γέμιση μανιτάρια"
                    + "2ο.Μενέστρα Ελασσόνας, τυρί φέτα - Μπριάμ, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(341, "1ο.Σουπα Μπεαρναίζ - Ομελέτα στραπατσάδα"
                    + "2ο.Μπιφτεέκι με ζυμαρικά  - Fussili φούρνου με χταπόδι"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(351, "1ο.Σούπα μπιστού - Σαλάτα κοχυλάκι"
                    + "2ο.Πρασόπιτα με ζαμπόν - Ομελέτα φούρνου,τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(361, "1ο.Σουπα κρέσυ - Σπανακοτυρόπιτα Καστοριάς"
                    + "2ο.Ψάρι εποχής φρέσκο πλακί - Ρολό κιμά πατάτες ριγανάτες"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(371, "1ο.Σούπα κάρδαμο - Κιμαδοκουλούρες"
                    + "2ο.Χορτοπικα κεφαλλονίτικη  - Κοτόπυλο ραβιόλια, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            // 3 MES
            foodList.Add(310, "1ο.Κρεατόσουπα με διάφορα λαχανικά - Ομελέτα με κρεμμύδια, πιπερίες, ντόματα, τυρί"
                    + "2ο.Λαζανάκι με κιμά, τυρί φέτα - Ψάρι φιλέτο γκούλας με ρύζι καρότα και αρακά"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(320, "1ο.Σούπα Ρυζότο μανιτάρια - Καλαμαράκια βραστά σαλάτα"
                    + "2ο.Κοτόπουλο συμπρέμ αλα κρεμ με μακαρονάκι κοφτο, τυρί φέτα - Σουβλάκι χοιρνό πατάτες φούρνου λεμονάτες"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(330, "1ο.Κρεατόσουπα κριθαράκι - Κολοκυθοκευτέδες με άνηθο και φέτα"
                    + "2ο.Φασόλια μαυρομάτικα, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(340, "1ο.Ντοματόσουπα βελουτέ"
                    + "2ο.Χοιρινό με πράσο - Κοτόπουλο γιουβέτσι, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(350, "1ο.Ψαρόσουπα - Τορτίγιες με λαχανικά"
                    + "2ο.Φάβα τυρί, φέτα, ελιές - Τατιατέλλες πράσινες με ντομάτα,τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(360, "1ο.Χορτόσουπα - Πίτα Καισάρειας"
                    + "2ο.Μοσχάρι γκούλας με ριζότο - Κοτόπουλο γεμιστό Ρομάνα με πέννες, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(370, "1ο.Κρεμμυδόσουπα - Σουφλέ ψαριού"
                    + "2ο.Χοιρινή τηγανιά με πατάτες τηγανιτές  - Μοσχάρι κοκκινιστό με κριθαράκι"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            // 4 BRAD
            foodList.Add(411, "1ο.Σούπα με κοκκινιστό τραχανά -  Φασόλια σαλάτα με τόνο"
                    + "2ο.Ρεγκατόνι με σάλτσα τόνου - Σπανακόρυζο, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(421, "1ο.Σούπα με σπανάκι - Τυροσαλάτα"
                    + "2ο.Γιουβαρλάκια αυγολέμονο - Παλαμίδα αυγολέμονο με κους κους"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(431, "1ο.Σούπα βελουτέ πατάτας - Πατατοσαλάτα με ελιές"
                    + "2ο.Λαχανόρυζο με κόκκινι σάλτσα, τυρί φέτα - Πενάκι με μυζήθρα και σαγκινάρες, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(441, "1ο.Καροτόσουπα βελουτέ - Τορτίγιες με πατάτες και φρέσκο κρεμμύδι"
                    + "2ο.Μπιτόκ αλα Ονγκουάζ πατάτες γιαχνί - Ταλιατέλες με σάλτσα πέστο, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(451, "1ο.Αρακόσουπα με πράσσα - Μελιτζάνες φούρνου με τυρί"
                    + "2ο.Τυρόπιτα στο τηγάνι πατατοσαλάτα - Ομελέτα φλαμπέ πατάτες φουρνου ριγανάτες, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(461, "1ο.Κοτόσουπα αυγολέμονο - Εντσιλάδες με λουκάνικο"
                    + "2ο.Παποθτσάκια με μελιτζάνες και κιμά, τυρί φέτα - Ψάρι φιλέτο σεϊθ λεμονάτο"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(471, "1ο.Σούπα γαλοπύλας με λαχανικά - Σουφλέ τυριού με μπεσαμέλ"
                    + "2ο.Σπανακόπιτα, κριθαράκι φούρνου  - Κοτόπουλο μπελ ωρόρ με πιλάφι,τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            // 4 MES
            foodList.Add(410, "1ο.Σούπα αλενουά - Τονοσαλάτα"
                    + "2ο.Ψάρι αλα σπετσιώτα - Μακαρόνια με μπαλάκια κιμά κοκκινιστά, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(420, "1ο.Σούπα κρέμα αγκινάρες - Μελιτζανόπιτα"
                    + "2ο.Κοτόπουλο δεντρολίβανο με πατάτες φούρνου, τυρί φέτα - Χοιρνό ψητό με πιλάφι"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(430, "1ο.Σούπα κρέμα μπρόκολο - Μακεδονίτικη πρασοκιμαδότπιτα"
                    + "2ο.Φασόλια σούπα, τυρί φέτα - Αγκινάρες βινεγκρέτ, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(440, "1ο.Σούπα σαμπενουά - Burritos με ομελέτα"
                    + "2ο.Χοιρινά φιλετάκια με μουστάρδα και πατάτες φούρνου - Γαλοπούλα με χυλοπίτες, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(450, "1ο.Σούπα ντύπαρύ - Τορτίγιες με λιωμένο τυρι και κιμά"
                    + "2ο.Φάβα Μυτιλήνης - Σουφλέ ζυμαρικών"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(460, "1ο.Σούπα λουγκσόν - Πίτα Σικελίας"
                    + "2ο.Μοσχάρι σουφλέ με κρητικό γαμοπίλαφο - Κοτόπουλο ψητό με πατάτες τηγανητές, τυρί φέτα"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");
            foodList.Add(470, "1ο.Κοτόσουπα αυγολέμονο - Σαλάτα Βουδαπέστης"
                    + "2ο.Χοιρινό σνιτσελ με ριζότο  - Μοσχάρι φαντασία με ζυμαρικά"
                    + "3ο.Σαλάτα εποχής"
                    + "4ο.Φρούτο εποχής - Γλυκό");


            /* telos arxikopoiisis tou pinaka 
       SimpleDateFormat format = new SimpleDateFormat("dd");
       SimpleDateFormat format2 = new SimpleDateFormat("MM");

       String daystr = format.format(curD);
       System.out.println("Day: " + daystr + "\nMonth: " + format2.format(curD));
       int sitisiweek = (Math.round((float) (Integer.parseInt(daystr)) / 7));
        */
            int dayofweek = curD.Day;
            String dayname = null;

            switch (dayofweek)
            {
                case 0:
                    dayname = "deutera";
                    break;
                case 1:
                    dayname = "triti";
                    break;
                case 2:
                    dayname = "tetarti";
                    break;
                case 3:
                    dayname = "pebti";
                    break;
                case 4:
                    dayname = "paraskevi";
                    break;
                case 5:
                    dayname = "savvato";
                    break;
                case 6:
                    dayname = "kuriaki";
                    break;
                default:
                    break;

            }
            code = code * 100;
            int day = (dayofweek + 1) * 10;
            Console.WriteLine("Code: " + code + " Day: " + day);
            return "Mesimeriano: " + foodList.get(code + day) + "\nBradno: " + foodList.get(code + day + 1);
        }
        public static int getAmvrosiaWeek(DateTime dt)
        {
            var diff = (int)(((dt - DateTime.Now).TotalDays) / 7);

            return (((int)diff + 3) % 4) + 1;
        }   //η συνάρτηση που υπολογίζει ποια εβδομάδα της Αμβροσίας είναι


        public static void Main(string[] args)
        {
            //testing stuff for a month
            /*int d = 1;
            for (int i=0;i<31;i++)
            {
                Console.WriteLine("Gia date:"+d+" evgale:");
                Console.WriteLine(getAmvrosiaWeek(new DateTime(2017, 4, d)));
                d++;
            }*/


            Console.WriteLine(getAmvrosiaWeek(DateTime.Now));
             
            Console.ReadLine();
        }
    }
}
